VincentDeng2018/0.1_OBC/Reference/en.stm32_f105-07_f2_f4_usb-host-device_lib/Project/USB_Device_Examples/AUDIO/src/stm324x9i_usb_audio_codec.c
/**
  ******************************************************************************
  * @file    stm324x9i_eval_audio_codec.c
  * @author  MCD Application Team
  * @version v1.2.1
  * @date    17-March-2018
  * @brief   This file includes the low layer driver for WM8994 Audio Codec
  *          available on STM324x9I_EVAL evaluation board.  
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                      <http://www.st.com/SLA0044>
  *
  ******************************************************************************
  */

/* File Info :
 * ------------------------------------------------------------------------------------------
 * User NOTES 1. How To use this driver: -------------------------- - This driver supports
 * STM32F4xx devices on STM324x9I-EVAL (MB1045) Evaluation boards.
 * 
 * - Configure the options in file STM324x9i_eval_audio_codec.h in the section CONFIGURATION.
 * Refer to the sections 2 and 3 to have more details on the possible configurations.
 * 
 * - Call the function EVAL_AUDIO_Init( OutputDevice : physical output mode
 * (OUTPUT_DEVICE_SPEAKER, OUTPUT_DEVICE_HEADPHONE or OUTPUT_DEVICE_BOTH) Volume : Initial
 * volume to be set (0 is min (mute), 100 is max (100%) AudioFreq : Audio frequency in Hz
 * (8000, 16000, 22500, 32000...) this parameter is relative to the audio file/stream type. )
 * This function configures all the hardware required for the audio application (codec, I2C,
 * SAI, GPIOs, DMA and interrupt if needed). This function returns 0 if configuration is OK.
 * if the returned value is different from 0 or the function is stuck then the communication
 * with the codec or the IOExpander has failed (try to un-plug the power or reset device in
 * this case). + OUTPUT_DEVICE_SPEAKER : only speaker will be set as output for the audio
 * stream. + OUTPUT_DEVICE_HEADPHONE: only headphones will be set as output for the audio
 * stream. + OUTPUT_DEVICE_BOTH : both Speaker and Headphone are used as outputs for the audio 
 * stream at the same time.
 * 
 * - Call the function EVAL_AUDIO_Play( pBuffer : pointer to the audio data file address Size
 * : size of the buffer to be sent in Bytes ) to start playing (for the first time) from the
 * audio file/stream.
 * 
 * - Call the function EVAL_AUDIO_PauseResume( Cmd: AUDIO_PAUSE (or 0) to pause playing or
 * AUDIO_RESUME (or any value different from 0) to resume playing. ) Note. After calling
 * EVAL_AUDIO_PauseResume() function for pause, only EVAL_AUDIO_PauseResume() should be called
 * for resume (it is not allowed to call EVAL_AUDIO_Play() in this case). Note. This function
 * should be called only when the audio file is played or paused (not stopped).
 * 
 * - For each mode, you may need to implement the relative callback functions into your code.
 * The Callback functions are named EVAL_AUDIO_XXX_CallBack() and only their prototypes are
 * declared in the STM324x9i_eval_audio_codec.h file. (refer to the example for more details
 * on the callbacks implementations)
 * 
 * - To Stop playing, to modify the volume level or to mute, use the functions
 * EVAL_AUDIO_Stop(), EVAL_AUDIO_VolumeCtl() and EVAL_AUDIO_Mute().
 * 
 * - The driver API and the callback functions are at the end of the
 * STM324x9i_eval_audio_codec.h file.
 * 
 * 
 * Driver architecture: -------------------- This driver is composed of three main layers: o
 * High Audio Layer: consists of the function API exported in the STM324x9i_eval_audio_codec.h
 * file (EVAL_AUDIO_Init(), EVAL_AUDIO_Play() ...) o Codec Control layer: consists of the
 * functions API controlling the audio codec (WM8994) and included as local functions in file
 * STM324x9i_eval_audio_codec.c (Codec_Init(), Codec_Play() ...) o Media Access Layer (MAL):
 * which consists of functions allowing to access the media containing/ providing the audio
 * file/stream. These functions are also included as local functions into the
 * STM324x9i_eval_audio_codec.c file (Audio_MAL_Init(), Audio_MAL_Play() ...) Each set of
 * functions (layer) may be implemented independently of the others and customized when
 * needed.
 * 
 * 2. Modes description: --------------------- + AUDIO_MAL_MODE_NORMAL : is suitable when the
 * audio file is in a memory location. + AUDIO_MAL_MODE_CIRCULAR: is suitable when the audio
 * data are read either from a memory location or from a device at real time (double buffer
 * could be used).
 * 
 * 3. DMA interrupts description: ------------------------------ + EVAL_AUDIO_IT_TC_ENABLE:
 * Enable this define to use the DMA end of transfer interrupt. then, a callback should be
 * implemented by user to perform specific actions when the DMA has finished the transfer. +
 * EVAL_AUDIO_IT_HT_ENABLE: Enable this define to use the DMA end of half transfer interrupt.
 * then, a callback should be implemented by user to perform specific actions when the DMA has
 * reached the half of the buffer transfer (generally, it is useful to load the first half of
 * buffer while DMA is loading from the second half). + EVAL_AUDIO_IT_ER_ENABLE: Enable this
 * define to manage the cases of error on DMA transfer.
 * 
 * 4. Known Limitations: ---------------------
 * 
 * 1- If the TDM Format used to paly in parallel 2 audio Stream (the first Stream is configured 
 * in codec SLOT0 and second Stream in SLOT1) the Pause/Resume, volume and mute feature will
 * control the both streams.
 * 
 * 2- Parsing of audio file is not implemented (in order to determine audio file properties:
 * Mono/Stereo, Data size, File size, Audio Frequency, Audio Data header size ...). The
 * configuration is fixed for the given audio file.
 * 
 * 3- Supports only 16-bit audio data size.
 * 
 * -------------------------------------------------------------------------------------------------------- */

