VincentDeng2018/0.1_OBC/Reference/en.stm32_f105-07_f2_f4_usb-host-device_lib/Project/USB_Device_Examples/AUDIO/src/stm324x9i_usb_audio_codec.c
#ifdef AUDIO_MAL_DMA_IT_TC_EN
  /* Transfer complete interrupt */
  if (DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TC) != RESET)
  {
#ifdef AUDIO_MAL_MODE_NORMAL
    /* Check if the end of file has been reached */
    if (AudioRemSize > DMA_MAX_SZE)
    {
      /* Wait the DMA Stream to be effectively disabled */
      while (DMA_GetCmdStatus(AUDIO_MAL_DMA_STREAM) != DISABLE)
      {
      }

      /* Clear the Interrupt flag */
      DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_ALL);

      /* Re-Configure the buffer address and size */
      DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t) CurrentPos;
      DMA_InitStructure.DMA_BufferSize = (uint32_t) (DMA_MAX(AudioRemSize));

      /* Configure the DMA Stream with the new parameters */
      DMA_Init(AUDIO_MAL_DMA_STREAM, &DMA_InitStructure);

      /* Enable the SAI DMA Stream */
      DMA_Cmd(AUDIO_MAL_DMA_STREAM, ENABLE);

      /* Update the current pointer position */
      CurrentPos += DMA_MAX(AudioRemSize);

      /* Update the remaining number of data to be played */
      AudioRemSize -= DMA_MAX(AudioRemSize);
    }
    else
    {
      /* Disable the SAI DMA Stream */
      DMA_Cmd(AUDIO_MAL_DMA_STREAM, DISABLE);

      /* Clear the Interrupt flag */
      DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TC);

      /* Manage the remaining file size and new address offset: This function
       * should be coded by user (its prototype is already declared in
       * stm32_eval_audio_codec.h) */
      EVAL_AUDIO_TransferComplete_CallBack((uint32_t) CurrentPos, 0);
    }

#elif defined(AUDIO_MAL_MODE_CIRCULAR)
    /* Manage the remaining file size and new address offset: This function
     * should be coded by user (its prototype is already declared in
     * stm32_eval_audio_codec.h) */
    EVAL_AUDIO_TransferComplete_CallBack((uint32_t) CurrentPos, AudioRemSize);

    /* Clear the Interrupt flag */
    DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TC);
#endif                          /* AUDIO_MAL_MODE_NORMAL */
  }
#endif                          /* AUDIO_MAL_DMA_IT_TC_EN */

#ifdef AUDIO_MAL_DMA_IT_HT_EN
  /* Half Transfer complete interrupt */
  if (DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_HT) != RESET)
  {
    /* Manage the remaining file size and new address offset: This function
     * should be coded by user (its prototype is already declared in
     * stm32_eval_audio_codec.h) */
    EVAL_AUDIO_HalfTransfer_CallBack((uint32_t) CurrentPos, AudioRemSize);

    /* Clear the Interrupt flag */
    DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_HT);
  }
#endif                          /* AUDIO_MAL_DMA_IT_HT_EN */

#ifdef AUDIO_MAL_DMA_IT_TE_EN
  /* FIFO Error interrupt */
  if ((DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TE) != RESET)
      || (DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_FE) !=
          RESET) ||
      (DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_DME) !=
       RESET))

  {
    /* Manage the error generated on DMA FIFO: This function should be coded
     * by user (its prototype is already declared in stm32_eval_audio_codec.h) */
    EVAL_AUDIO_Error_CallBack((uint32_t *) & CurrentPos);

    /* Clear the Interrupt flag */
    DMA_ClearFlag(AUDIO_MAL_DMA_STREAM,
                  AUDIO_MAL_DMA_FLAG_TE | AUDIO_MAL_DMA_FLAG_FE |
                  AUDIO_MAL_DMA_FLAG_DME);
  }
#endif                          /* AUDIO_MAL_DMA_IT_TE_EN */
}

/*---------------------------------------------------------------------------
                WM8994 Audio Codec Control Functions
 -----------------------------------------------------------------------------*/
/**
  * @brief  Initializes the audio codec and all related interfaces (control 
  *         interface: I2C and audio interface: SAI)
  * @param  OutputDevice: physical output mode (OUTPUT_DEVICE_SPEAKER, 
                          OUTPUT_DEVICE_HEADPHONE or OUTPUT_DEVICE_BOTH)
  * @param  Volume: Initial volume level (from 0 (Mute) to 100 (Max))
  * @param  AudioFreq: Audio frequency used to play the audio stream.
  * @retval 0 if correct communication, else wrong communication
  */
static uint32_t Codec_Init(uint16_t OutputDevice, uint8_t Volume,
                           uint32_t AudioFreq)
{
  uint32_t counter = 0;

  /* Configure the Codec related IOs */
  Codec_GPIO_Init();

  /* Configure the SAI peripheral */
  Codec_AudioInterface_Init(AudioFreq);

  /* Enable SAI Block A to Start the communication */
  SAI_Cmd(SAI1_Block_B, ENABLE);
  SAI_SendData(SAI1_Block_B, 0x00);

  /* Initialize the Control interface of the Audio Codec */
  Codec_CtrlInterface_Init();

  /* Reset the Codec Registers */
  Codec_Reset();

  /* WM8994 Codec configuration */

  /* Errata Work-Arounds */

  counter += Codec_WriteRegister(0x102, 0x0003);
  counter += Codec_WriteRegister(0x817, 0x0000);
  counter += Codec_WriteRegister(0x102, 0x0000);

  /* Analog Configuration */

  /* Enable VMID soft start (fast), Start-up Bias Current Enabled */
  counter += Codec_WriteRegister(0x39, 0x0064);

  /* Enable bias generator, Enable VMID */
  counter += Codec_WriteRegister(0x01, 0x0003);

  /* Add Delay */
  Delay(50);

  /* Path Configurations */

  switch (OutputDevice)
  {
  case OUTPUT_DEVICE_BOTH:
    /* Enable DAC1 (Left), Enable DAC1 (Right), also Enable DAC2 (Left),
     * Enable DAC2 (Right) */
    counter += Codec_WriteRegister(0x05, 0x0303 | 0x0C0C);

    /* Enable the AIF1 Timeslot 0 (Left) to DAC 1 (Left) mixer path */
    counter += Codec_WriteRegister(0x601, 0x0001);

    /* Enable the AIF1 Timeslot 0 (Right) to DAC 1 (Right) mixer path */
    counter += Codec_WriteRegister(0x602, 0x0001);

    /* Enable the AIF1 Timeslot 1 (Left) to DAC 2 (Left) mixer path */
    counter += Codec_WriteRegister(0x604, 0x0002);

    /* Enable the AIF1 Timeslot 1 (Right) to DAC 2 (Right) mixer path */
    counter += Codec_WriteRegister(0x605, 0x0002);
    break;

  case OUTPUT_DEVICE_SPEAKER:
    /* Enable DAC1 (Left), Enable DAC1 (Right), Disable DAC2 (Left), Disable
     * DAC2 (Right) */
    counter += Codec_WriteRegister(0x05, 0x0C0C);

    /* Enable the AIF1 Timeslot 0 (Left) to DAC 1 (Left) mixer path */
    counter += Codec_WriteRegister(0x601, 0x0000);

    /* Enable the AIF1 Timeslot 0 (Right) to DAC 1 (Right) mixer path */
    counter += Codec_WriteRegister(0x602, 0x0000);

    /* Disable the AIF1 Timeslot 1 (Left) to DAC 2 (Left) mixer path */
    counter += Codec_WriteRegister(0x604, 0x0002);

