VincentDeng2018/0.1_OBC/Reference/en.stm32_f105-07_f2_f4_usb-host-device_lib/Project/USB_Device_Examples/AUDIO/src/stm324x9i_usb_audio_codec.c
    /* Disable the AIF1 Timeslot 1 (Right) to DAC 2 (Right) mixer path */
    counter += Codec_WriteRegister(0x605, 0x0002);
    break;

  case OUTPUT_DEVICE_HEADPHONE:
    /* Disable DAC1 (Left), Disable DAC1 (Right), Enable DAC2 (Left), Enable
     * DAC2 (Right) */
    counter += Codec_WriteRegister(0x05, 0x0303);

    /* Enable the AIF1 Timeslot 0 (Left) to DAC 1 (Left) mixer path */
    counter += Codec_WriteRegister(0x601, 0x0001);

    /* Enable the AIF1 Timeslot 0 (Right) to DAC 1 (Right) mixer path */
    counter += Codec_WriteRegister(0x602, 0x0001);

    /* Disable the AIF1 Timeslot 1 (Left) to DAC 2 (Left) mixer path */
    counter += Codec_WriteRegister(0x604, 0x0000);

    /* Disable the AIF1 Timeslot 1 (Right) to DAC 2 (Right) mixer path */
    counter += Codec_WriteRegister(0x605, 0x0000);
    break;

  default:
    /* Disable DAC1 (Left), Disable DAC1 (Right), Enable DAC2 (Left), Enable
     * DAC2 (Right) */
    counter += Codec_WriteRegister(0x05, 0x0303);

    /* Enable the AIF1 Timeslot 0 (Left) to DAC 1 (Left) mixer path */
    counter += Codec_WriteRegister(0x601, 0x0001);

    /* Enable the AIF1 Timeslot 0 (Right) to DAC 1 (Right) mixer path */
    counter += Codec_WriteRegister(0x602, 0x0001);

    /* Disable the AIF1 Timeslot 1 (Left) to DAC 2 (Left) mixer path */
    counter += Codec_WriteRegister(0x604, 0x0000);

    /* Disable the AIF1 Timeslot 1 (Right) to DAC 2 (Right) mixer path */
    counter += Codec_WriteRegister(0x605, 0x0000);
    break;
  }


  /* Clock Configurations */
  switch (AudioFreq)
  {
  case SAI_AudioFreq_8k:
    /* AIF1 Sample Rate = 8 (Khz), ratio=256 */
    counter += Codec_WriteRegister(0x210, 0x0003);
    break;

  case SAI_AudioFreq_16k:
    /* AIF1 Sample Rate = 16 (Khz), ratio=256 */
    counter += Codec_WriteRegister(0x210, 0x0033);
    break;

  case SAI_AudioFreq_48k:
    /* AIF1 Sample Rate = 48 (Khz), ratio=256 */
    counter += Codec_WriteRegister(0x210, 0x0083);
    break;

  case SAI_AudioFreq_96k:
    /* AIF1 Sample Rate = 96 (Khz), ratio=256 */
    counter += Codec_WriteRegister(0x210, 0x00A3);
    break;

  case SAI_AudioFreq_11k:
    /* AIF1 Sample Rate = 11.025 (Khz), ratio=256 */
    counter += Codec_WriteRegister(0x210, 0x0013);
    break;

  case SAI_AudioFreq_22k:
    /* AIF1 Sample Rate = 22.050 (Khz), ratio=256 */
    counter += Codec_WriteRegister(0x210, 0x0043);
    break;

  case SAI_AudioFreq_44k:
    /* AIF1 Sample Rate = 44.1 (Khz), ratio=256 */
    counter += Codec_WriteRegister(0x210, 0x0073);
    break;

  default:
    /* AIF1 Sample Rate = 48 (Khz), ratio=256 */
    counter += Codec_WriteRegister(0x210, 0x0083);
    break;
  }

  /* AIF1 Word Length = 16-bits, AIF1 Format = I2S (Default Register Value) */
  counter += Codec_WriteRegister(0x300, 0x4010);

  /* slave mode */
  counter += Codec_WriteRegister(0x302, 0x0000);

  /* Enable the DSP processing clock for AIF1, Enable the core clock */
  counter += Codec_WriteRegister(0x208, 0x000A);

  /* Enable AIF1 Clock, AIF1 Clock Source = MCLK1 pin */
  counter += Codec_WriteRegister(0x200, 0x0001);

  /* Analog Output Configuration */

  /* Enable SPKRVOL PGA, Enable SPKMIXR, Enable SPKLVOL PGA, Enable SPKMIXL */
  counter += Codec_WriteRegister(0x03, 0x0300);

  /* Left Speaker Mixer Volume = 0dB */
  counter += Codec_WriteRegister(0x22, 0x0000);

  /* Speaker output mode = Class D, Right Speaker Mixer Volume = 0dB ((0x23,
   * 0x0100) = class AB) */
  counter += Codec_WriteRegister(0x23, 0x0000);

  /* Volume Control */
  Codec_VolumeCtrl(Volume);

  /* Unmute DAC2 (Left) to Left Speaker Mixer (SPKMIXL) path, Unmute DAC2
   * (Right) to Right Speaker Mixer (SPKMIXR) path */
  counter += Codec_WriteRegister(0x36, 0x0300);

  /* Enable bias generator, Enable VMID, Enable SPKOUTL, Enable SPKOUTR */
  counter += Codec_WriteRegister(0x01, 0x3003);

  /* Headphone/Speaker Enable */

  /* Enable Class W, Class W Envelope Tracking = AIF1 Timeslot 0 */
  counter += Codec_WriteRegister(0x51, 0x0005);

  /* Enable bias generator, Enable VMID, Enable HPOUT1 (Left) and Enable HPOUT1 
   * (Right) input stages */
  /* idem for Speaker */
  counter += Codec_WriteRegister(0x01, 0x0303 | 0x3003);

  /* Enable HPOUT1 (Left) and HPOUT1 (Right) intermediate stages */
  counter += Codec_WriteRegister(0x60, 0x0022);

  /* Enable Charge Pump */
  counter += Codec_WriteRegister(0x4C, 0x9F25);

  /* Add Delay */
  Delay(15);

  /* Select DAC1 (Left) to Left Headphone Output PGA (HPOUT1LVOL) path */
  counter += Codec_WriteRegister(0x2D, 0x0001);

  /* Select DAC1 (Right) to Right Headphone Output PGA (HPOUT1RVOL) path */
  counter += Codec_WriteRegister(0x2E, 0x0001);

  /* Enable Left Output Mixer (MIXOUTL), Enable Right Output Mixer (MIXOUTR) */
  /* idem for SPKOUTL and SPKOUTR */
  counter += Codec_WriteRegister(0x03, 0x0030 | 0x0300);

  /* Enable DC Servo and trigger start-up mode on left and right channels */
  counter += Codec_WriteRegister(0x54, 0x0033);

  /* Add Delay */
  Delay(250);

  /* Enable HPOUT1 (Left) and HPOUT1 (Right) intermediate and output stages.
   * Remove clamps */
  counter += Codec_WriteRegister(0x60, 0x00EE);

  /* Unmute */

  /* Unmute DAC 1 (Left) */
  counter += Codec_WriteRegister(0x610, 0x00C0);

  /* Unmute DAC 1 (Right) */
  counter += Codec_WriteRegister(0x611, 0x00C0);

  /* Unmute the AIF1 Timeslot 0 DAC path */
  counter += Codec_WriteRegister(0x420, 0x0000);

  /* Unmute DAC 2 (Left) */
  counter += Codec_WriteRegister(0x612, 0x00C0);

  /* Unmute DAC 2 (Right) */
  counter += Codec_WriteRegister(0x613, 0x00C0);

  /* Unmute the AIF1 Timeslot 1 DAC2 path */
  counter += Codec_WriteRegister(0x422, 0x0000);

  SAI_Cmd(SAI1_Block_B, DISABLE);

  /* Return communication control value */
  return counter;
}

/**
  * @brief  Restore the audio codec state to default state and free all used 
  *         resources.
  * @param  None
  * @retval 0 if correct communication, else wrong communication
  */
static uint32_t Codec_DeInit(void)
{
  uint32_t counter = 0;

  /* Reset the Codec Registers */
  Codec_Reset();

  /* Deinitialize all use GPIOs */
  Codec_GPIO_DeInit();

  /* Disable the Codec control interface */
  Codec_CtrlInterface_DeInit();

  /* Deinitialize the Codec audio interface (I2S) */
  Codec_AudioInterface_DeInit();

  /* Return communication control value */
  return counter;
}

/**
  * @brief  Start the audio Codec play feature.
  * @note   For this codec no Play options are required.
  * @param  None
  * @retval 0 if correct communication, else wrong communication
  */
static uint32_t Codec_Play(void)
{
  /* 
   * No actions required on Codec level for play command */

  /* Return communication control value */
  return 0;
}

/**
  * @brief  Pauses and resumes playing on the audio codec.
  * @param  Cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different
  *         from 0) to resume. 
  * @retval 0 if correct communication, else wrong communication
  */
static uint32_t Codec_PauseResume(uint32_t Cmd)
{
  uint32_t counter = 0;

  /* Pause the audio file playing */
  if (Cmd == AUDIO_PAUSE)
  {
    /* Mute the output */
    counter += Codec_Mute(AUDIO_MUTE_ON);
  }
  else                          /* AUDIO_RESUME */
  {
    /* Unmute the output */
    counter += Codec_Mute(AUDIO_MUTE_OFF);
  }
  return counter;
}

/**
  * @brief  Stops audio playing and enables the MUTE mode by software.
  * @param  CodecPdwnMode: could be one of the following parameters
  *          - CODEC_PDWN_SW: only mutes the audio codec. When resuming from this 
  *                           mode the codec keeps the previous initialization
  *                           (no need to re-Initialize the codec registers).
  *          - CODEC_PDWN_HW: Reset the codec (Software Reset). When resuming from this
  *                           mode, the codec is set to default configuration 
  *                           (user should re-Initialize the codec in order to 
  *                            play again the audio stream).
  * @note   Codec will not be physically powered-down.
  * @retval 0 if correct communication, else wrong communication
  */
static uint32_t Codec_Stop(uint32_t CodecPdwnMode)
{
  uint32_t counter = 0;

  /* Mute the output first */
  counter += Codec_Mute(AUDIO_MUTE_ON);

  if (CodecPdwnMode == CODEC_PDWN_SW)
  {
    /* Only output mute required */
  }
  else                          /* CODEC_PDWN_HW */
  {
    /* Mute the AIF1 Timeslot 0 DAC1 path */
    counter += Codec_WriteRegister(0x420, 0x0200);

    /* Mute the AIF1 Timeslot 1 DAC2 path */
    counter += Codec_WriteRegister(0x422, 0x0200);

    /* Disable DAC1L_TO_HPOUT1L */
    counter += Codec_WriteRegister(0x2D, 0x0000);

    /* Disable DAC1R_TO_HPOUT1R */
    counter += Codec_WriteRegister(0x2E, 0x0000);

    /* Disable DAC1 and DAC2 */
    counter += Codec_WriteRegister(0x05, 0x0000);

    /* Reset Codec by wrinting in 0x0000 address register */
    counter += Codec_WriteRegister(0x0000, 0x0000);

    /* Delay ms */
    Delay(10);
  }

