VincentDeng2018/0.1_OBC/Reference/en.stm32_f105-07_f2_f4_usb-host-device_lib/Project/USB_Device_Examples/AUDIO/src/stm324x9i_usb_audio_codec.c
  return counter;
}

/**
  * @brief  Sets higher or lower the codec volume level.
  * @param  Volume: a byte value from 0 to 63 (refer to codec registers 
  *         description for more details).
  * @retval 0 if correct communication, else wrong communication
  */
static uint32_t Codec_VolumeCtrl(uint8_t Volume)
{
  uint32_t counter = 0;

  if (Volume > 0x3E)
  {
    /* Unmute audio codec */
    Codec_Mute(AUDIO_MUTE_OFF);

    /* Left Headphone Volume */
    counter += Codec_WriteRegister(0x1C, 0x3F | 0x140);

    /* Right Headphone Volume */
    counter += Codec_WriteRegister(0x1D, 0x3F | 0x140);

    /* Left Speaker Volume */
    counter += Codec_WriteRegister(0x26, 0x3F | 0x140);

    /* Right Speaker Volume */
    counter += Codec_WriteRegister(0x27, 0x3F | 0x140);
  }
  else if (Volume == 0)
  {
    /* Mute audio codec */
    Codec_Mute(AUDIO_MUTE_ON);
  }
  else
  {
    /* Unmute audio codec */
    Codec_Mute(AUDIO_MUTE_OFF);

    /* Left Headphone Volume */
    counter += Codec_WriteRegister(0x1C, Volume | 0x140);

    /* Right Headphone Volume */
    counter += Codec_WriteRegister(0x1D, Volume | 0x140);

    /* Left Speaker Volume */
    counter += Codec_WriteRegister(0x26, Volume | 0x140);

    /* Right Speaker Volume */
    counter += Codec_WriteRegister(0x27, Volume | 0x140);
  }

  return counter;
}

/**
  * @brief  Enables or disables the mute feature on the audio codec.
  * @param  Cmd: AUDIO_MUTE_ON to enable the mute or AUDIO_MUTE_OFF to disable the
  *             mute mode.
  * @retval 0 if correct communication, else wrong communication
  */
static uint32_t Codec_Mute(uint32_t Cmd)
{
  uint32_t counter = 0;

  /* Set the Mute mode */
  if (Cmd == AUDIO_MUTE_ON)
  {
    /* Soft Mute the AIF1 Timeslot 0 DAC1 path L&R */
    counter += Codec_WriteRegister(0x420, 0x0200);

    /* Soft Mute the AIF1 Timeslot 1 DAC2 path L&R */
    counter += Codec_WriteRegister(0x422, 0x0200);
  }
  else                          /* AUDIO_MUTE_OFF Disable the Mute */
  {
    /* Unmute the AIF1 Timeslot 0 DAC1 path L&R */
    counter += Codec_WriteRegister(0x420, 0x0000);

    /* Unmute the AIF1 Timeslot 1 DAC2 path L&R */
    counter += Codec_WriteRegister(0x422, 0x0000);
  }

  return counter;
}

/**
  * @brief  Resets the audio codec. It restores the default configuration of the 
  *         codec (this function shall be called before initializing the codec).
  * @param  None
  * @retval None
  */

static void Codec_Reset(void)
{
  uint32_t counter = 0;

  /* Reset Codec by wrinting in 0x0000 address register */
  counter += Codec_WriteRegister(0x0000, 0x0000);

  /* Delay ms */
  Delay(10);
}


/**
  * @brief  Writes a Byte to a given register into the audio codec through the 
            control interface (I2C)
  * @param  RegisterAddr: The address (location) of the register to be written.
  * @param  RegisterValue: the Byte value to be written into destination register.
  * @retval 0 if correct communication, else wrong communication
  */
static uint32_t Codec_WriteRegister(uint16_t RegisterAddr,
                                    uint16_t RegisterValue)
{
  uint32_t result = 0;

  /* While the bus is busy */
  CODECTimeout = CODEC_LONG_TIMEOUT;
  while (I2C_GetFlagStatus(CODEC_I2C, I2C_FLAG_BUSY))
  {
    if ((CODECTimeout--) == 0)
      return Codec_TIMEOUT_UserCallback();
  }

  /* Start the config sequence */
  I2C_GenerateSTART(CODEC_I2C, ENABLE);

  /* Test on EV5 and clear it */
  CODECTimeout = CODEC_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_MODE_SELECT))
  {
    if ((CODECTimeout--) == 0)
      return Codec_TIMEOUT_UserCallback();
  }

  /* Transmit the slave address and enable writing operation */
  I2C_Send7bitAddress(CODEC_I2C, CODEC_ADDRESS, I2C_Direction_Transmitter);

  /* Test on EV6 and clear it */
  CODECTimeout = CODEC_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
  {
    if ((CODECTimeout--) == 0)
      return Codec_TIMEOUT_UserCallback();
  }

  /* Transmit the MSB address first for write operation */
  I2C_SendData(CODEC_I2C, (uint8_t) (RegisterAddr >> 8));

  /* Test on EV8 and clear it */
  CODECTimeout = CODEC_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
  {
    if ((CODECTimeout--) == 0)
      return Codec_TIMEOUT_UserCallback();
  }

  /* Transmit the LSB address for write operation */
  I2C_SendData(CODEC_I2C, (uint8_t) (RegisterAddr));

  /* Test on EV8 and clear it */
  CODECTimeout = CODEC_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
  {
    if ((CODECTimeout--) == 0)
      return Codec_TIMEOUT_UserCallback();
  }

  /* Prepare the register value to be sent (MSB first) */
  I2C_SendData(CODEC_I2C, (uint8_t) (RegisterValue >> 8));

  /* Test on EV8 and clear it */
  CODECTimeout = CODEC_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
  {
    if ((CODECTimeout--) == 0)
      return Codec_TIMEOUT_UserCallback();
  }

  /* Prepare the register value to be sent (LSB) */
  I2C_SendData(CODEC_I2C, (uint8_t) (RegisterValue));

  /* !< Wait till all data have been physically transferred on the bus */
  CODECTimeout = CODEC_LONG_TIMEOUT;
  while (!I2C_GetFlagStatus(CODEC_I2C, I2C_FLAG_BTF))
  {
    if ((CODECTimeout--) == 0)
      Codec_TIMEOUT_UserCallback();
  }

  /* End the configuration sequence */
  I2C_GenerateSTOP(CODEC_I2C, ENABLE);

#ifdef VERIFY_WRITTENDATA
  /* Verify that the data has been correctly written */
  result = (Codec_ReadRegister(RegisterAddr) == RegisterValue) ? 0 : 1;
#endif                          /* VERIFY_WRITTENDATA */

  /* Return the verifying value: 0 (Passed) or 1 (Failed) */
  return result;
}

/**
  * @brief  Reads and returns the value of an audio codec register through the
  *         control interface (I2C).
  * @param  RegisterAddr: Address of the register to be read.
  * @retval Value of the register to be read or dummy value if the communication
  *         fails.
  */
static uint32_t Codec_ReadRegister(uint16_t RegisterAddr)
{
  uint32_t result = 0;

  /* While the bus is busy */
  CODECTimeout = CODEC_LONG_TIMEOUT;
  while (I2C_GetFlagStatus(CODEC_I2C, I2C_FLAG_BUSY))
  {
    if ((CODECTimeout--) == 0)
      return Codec_TIMEOUT_UserCallback();
  }

