VincentDeng2018/0.1_OBC/Reference/en.stm32_f105-07_f2_f4_usb-host-device_lib/Project/USB_Device_Examples/AUDIO/src/stm324x9i_usb_audio_codec.c
  /* Configure SAI_Block_x Frame Frame Length : 32 Frame active Length: 16 FS
   * Definition : Start frame + Channel Side identification FS Polarity: FS
   * active Low FS Offset: FS asserted one bit before the first bit of slot 0 */
  SAI_FrameInitStructure.SAI_FrameLength = 64;
  SAI_FrameInitStructure.SAI_ActiveFrameLength = 32;
  SAI_FrameInitStructure.SAI_FSDefinition = I2S_FS_ChannelIdentification;
  SAI_FrameInitStructure.SAI_FSPolarity = SAI_FS_ActiveLow;
  SAI_FrameInitStructure.SAI_FSOffset = SAI_FS_BeforeFirstBit;
  SAI_FrameInit(CODEC_SAI, &SAI_FrameInitStructure);

  /* Configure SAI Block_x Slot Slot First Bit Offset : 0 Slot Size : 16 Slot
   * Number : 4 Slot Active : All slot actives */
  SAI_SlotInitStructure.SAI_FirstBitOffset = 0;
  SAI_SlotInitStructure.SAI_SlotSize = SAI_SlotSize_16b;
  SAI_SlotInitStructure.SAI_SlotSize = SAI_SlotSize_DataSize;
  SAI_SlotInitStructure.SAI_SlotNumber = 4;
  SAI_SlotInitStructure.SAI_SlotActive = USR_SAI_SlotActive;
  SAI_SlotInit(CODEC_SAI, &SAI_SlotInitStructure);

  SAI_FlushFIFO(CODEC_SAI);

  /* Mono Mode Config */
#ifdef MONO_MODE
  SAI_MonoModeConfig(CODEC_SAI, SAI_MonoMode);
#endif                          /* MONO_MODE */

  /* The SAI peripheral will be enabled only in the EVAL_AUDIO_Play() function
   * or by user functions if DMA mode not enabled */
}

/**
  * @brief  Restores the Audio Codec audio interface to its default state.
  * @param  None
  * @retval None
  */
static void Codec_AudioInterface_DeInit(void)
{
  /* Disable the CODEC_SAI peripheral (in case it hasn't already been disabled) 
   */
  SAI_Cmd(CODEC_SAI, DISABLE);

  /* Deinitialize the CODEC_SAI peripheral */
  SAI_DeInit(SAI1);

  /* Disable the CODEC_SAI peripheral clock */
  RCC_APB2PeriphClockCmd(CODEC_SAI_CLK, DISABLE);
}

/**
  * @brief Initializes IOs used by the Audio Codec (on the control and audio 
  *        interfaces).
  * @param  None
  * @retval None
  */
static void Codec_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Enable SAI and I2C GPIO clocks */
  RCC_AHB1PeriphClockCmd(CODEC_I2C_GPIO_CLOCK | CODEC_SAI_GPIO_CLOCK, ENABLE);

  /* CODEC_I2C SCL and SDA pins configuration
   * ------------------------------------- */
  /* Connect pins to Periph */
  /* If the I2C peripheral is already enabled, don't reconfigure it */
  if ((CODEC_I2C->CR1 & I2C_CR1_PE) == 0)
  {
    GPIO_PinAFConfig(CODEC_I2C_GPIO, CODEC_I2C_SCL_PINSRC, CODEC_I2C_GPIO_AF);
    GPIO_PinAFConfig(CODEC_I2C_GPIO, CODEC_I2C_SDA_PINSRC, CODEC_I2C_GPIO_AF);

    GPIO_InitStructure.GPIO_Pin = CODEC_I2C_SCL_PIN | CODEC_I2C_SDA_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_Init(CODEC_I2C_GPIO, &GPIO_InitStructure);
  }
  /* CODEC_SAI SD MCLK SCK and FS pins configuration
   * -------------------------------- */

  /* SAI1_Block_B Pins configuration **************************************** */
  /* Connect pin to Periph */
  /* Configuration SAI1_BLockB_SD Alternate */
  GPIO_PinAFConfig(CODEC_SAI_GPIO, CODEC_SAI_SD_PINSRC, GPIO_AF_SAI1);
  /* Configuration SAI1_BLockB_MCLK Alternate */
  GPIO_PinAFConfig(CODEC_SAI_GPIO, CODEC_SAI_MCK_PINSRC, GPIO_AF_SAI1);
  /* Configuration SAI1_BLockB_SCK Alternate */
  GPIO_PinAFConfig(CODEC_SAI_GPIO, CODEC_SAI_SCK_PINSRC, GPIO_AF_SAI1);
  /* Configuration SAI1_BLockB_FS Alternate */
  GPIO_PinAFConfig(CODEC_SAI_GPIO, CODEC_SAI_FS_PINSRC, GPIO_AF_SAI1);

  /* Configure pins as AF pushpull */
  GPIO_InitStructure.GPIO_Pin = CODEC_SAI_MCK_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(CODEC_SAI_GPIO, &GPIO_InitStructure);

  /* Configure pins as AF pushpull */
  GPIO_InitStructure.GPIO_Pin =
    CODEC_SAI_FS_PIN | CODEC_SAI_SD_PIN | CODEC_SAI_SCK_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(CODEC_SAI_GPIO, &GPIO_InitStructure);
}

/**
  * @brief  Restores the IOs used by the Audio Codec interface to their default state.
  * @param  None
  * @retval None
  */
static void Codec_GPIO_DeInit(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Deinitialize all the GPIOs used by the driver */
  GPIO_InitStructure.GPIO_Pin =
    CODEC_SAI_FS_PIN | CODEC_SAI_SD_PIN | CODEC_SAI_SCK_PIN | CODEC_SAI_MCK_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(CODEC_SAI_GPIO, &GPIO_InitStructure);
  /* Disconnect pins from SAI peripheral */
  GPIO_PinAFConfig(CODEC_SAI_GPIO, CODEC_SAI_SD_PINSRC, 0x00);
  GPIO_PinAFConfig(CODEC_SAI_GPIO, CODEC_SAI_MCK_PINSRC, 0x00);
  GPIO_PinAFConfig(CODEC_SAI_GPIO, CODEC_SAI_SCK_PINSRC, 0x00);
  GPIO_PinAFConfig(CODEC_SAI_GPIO, CODEC_SAI_FS_PINSRC, 0x00);
}

/**
  * @brief  Inserts a delay time (not accurate timing).
  * @param  nCount: specifies the delay time length.
  * @retval None
  */
static void Delay(__IO uint32_t nCount)
{
  for (; nCount != 0; nCount--);
}

#ifdef USE_DEFAULT_TIMEOUT_CALLBACK
/**
  * @brief  Basic management of the timeout situation.
  * @param  None
  * @retval None
  */
uint32_t Codec_TIMEOUT_UserCallback(void)
{
  /* The following code allows I2C error recovery and return to normal
   * communication if the error source doesn’t still exist (ie. hardware
   * issue..) */
  I2C_InitTypeDef I2C_InitStructure;

  /* LCD_ErrLog("> I2C Timeout error occurred\n"); */

  I2C_GenerateSTOP(CODEC_I2C, ENABLE);
  I2C_SoftwareResetCmd(CODEC_I2C, ENABLE);
  I2C_SoftwareResetCmd(CODEC_I2C, DISABLE);

  /* CODEC_I2C peripheral configuration */
  I2C_DeInit(CODEC_I2C);
  I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
  I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
  I2C_InitStructure.I2C_OwnAddress1 = 0x34;
  I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
  I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
  I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;
  /* Enable the I2C peripheral */
  I2C_Cmd(CODEC_I2C, ENABLE);
  I2C_Init(CODEC_I2C, &I2C_InitStructure);

  /* At this stage the I2C error should be recovered and device can communicate
   * again (except if the error source still exist). User can implement
   * mechanism (ex. test on max trial number) to manage situation when the I2C
   * can't recover from current error. */

  /* LCD_UsrLog("> I2C error recovered.\n"); */

